"""Перечисления"""
from enum import IntEnum


class MarkerTool(IntEnum):
    """Инструмент для печати"""

    NONE = 0x00
    """Без печати"""

    LEFT = 0x01
    """Использовать маркер слева"""

    RIGHT = 0x02
    """Использовать маркер справа"""


class PlannerMode(IntEnum):
    """Режим работы планировщика перемещения"""

    POSITION = 0x00
    """0 порядок (По позиции)"""

    SPEED = 0x01
    """1 порядок (Со скоростью)"""

    ACCEL = 0x02
    """2 порядок (Со скоростью и ускорением)"""
